<?php
//命名请 与 statuskey 命名保持一致
//使用函数 getMenan();
return [

    'shop_stock_change_type' => [
        1 => '订单出库(-)',
        2 => '盘点减少(-)',
        11 => '商品录入(+)',
        12 => '退货入库(+)',
        13 => '盘点增加(+)',
    ],
    //商品属性 录入方式
    'shop_attr_input_type' => [
        0  => '手工录入',
        1  => '从列表中选择',
        2  => '多行文本',
    ],
    //商品活动类型
    'shop_prom_type' => [
        0 => '无活动',
        1 => '砍价活动',
        2 => '拼团活动',
        3 => '抢购活动',
        4 => '打折活动',
        5 => '满减活动',
    ],
    //快递类型
    'freight_type'  => [
        0  => '计件数',
        1  => '计重量',
    ],
    'shop_stock_status_mean' => [
        1 => '无货',
        2 => '即将售罄',
        3 => '库存紧张',
        4 => '需要关注',
        5 => '库存充足',
    ],
    'template_type' => [
        1 => '限免',
        2 => '免费',
        3 => '收费',
    ],
    'coupon_type' => [
        0 => '下单赠送',
        1 => '指定发放',
        2 => '免费领取',
    ],
    'coupon_use_type' => [
        0 => '普通券',
        1 => 'PLUS专享',
        2 => '新人专享',
    ],
    'coupon_usearea' => [
        0 => '全场通用',
        1 => '指定分类',
    ],
    'agent_apply_audit_setting' => [
        1 => '申请即通过',
        2 => '申请需审核',
    ],
    'agent_junior_setting' => [
        1 => '首次点击分享链接',
        2 => '首次下单',
        3 => '首次付款',
    ],

    //顾问类型
    'agent_group' => [
        0 => '未开通',
        1 => '普通顾问',
        2 => '资深顾问',
        3 => '专家顾问',
    ],

    //积分订单状态
    'integral_order_status' => [
        0 => '待确认',
        1 => '已确认',
        2 => '已收货',
        3 => '已取消',
        4 => '已完成',
        5 => '已关闭',
    ],
    //物流状态
    'integral_order_shipping_status' => [
        0 => '未发货',
        1 => '已发货',
        2 => '部分发货',
        3 => '物流已结束'
    ],
    //订单支付状态
    'integral_order_pay_status' => [
        0 => '未支付',
        1 => '已支付',
        2 => '申请退款',
        3 => '已退款',
        4 => '拒绝退款',
    ],
    //积分消费/活动类型
    'integral_log_type' => [
        1 => '下单赠送(+)',
        2 => '好评赠送(+)',
        3 => '签到奖励(+)',
//        4 => '推广奖励',
        5 =>  '后台赠送(+)',
        6 =>  '系统退还(+)',
        11 => '兑换商品(-)',
        12 => '后台扣除(-)'
    ],
    //积分订单取消理由
    'integral_order_cancel_reason' => [
        1 => '付款一周内商家未发货',
        2 => '买多了/买错了',
        3 => '计划有变，不想买了',
    ],

    //订单支付方式
    'order_payment_method' => [
        1 => '微信支付',
        2 => '支付宝支付',
        3 => '百度支付（聚合）',
        4 => '余额支付',
        5 => '微信支付H5',
        6 => '支付宝支付H5',
        7 => '头条支付(支付宝)',
        8 => '后台标记支付',
    ],
    //顾问分佣类型
    'agent_money_type' => [
        1 => '推广用户开通会员卡',
        2 => '推广用户订单提成',
        3 => '子顾问推广开通会员卡',
        4 => '子顾问推广用户订单提成',
        11 => '提现',
    ],
    //用户余额类型
    'user_money_type' => [
        1 =>  '充值(+)',
        2 =>  '订单退款(+)',
        3 =>  '后台赠送(+)',
        11 => '提现(-)',
        12 => '购物消费(-)',
        13 => '后台扣除(-)',
        14 => '开通会员(-)',
    ],
    //订单状态
    'order_status' => [
        0 => '待确认',
        1 => '已确认',
        2 => '已收货',
        3 => '已取消',
        4 => '已完成',
        5 => '已关闭',
    ],
    //物流状态
    'order_shipping_status' => [
        0 => '未发货',
        1 => '已发货',
        2 => '部分发货',
        3 => '物流已结束'
    ],
    //订单支付状态
    'order_pay_status' => [
        0 => '未支付',
        1 => '已支付',
        2 => '申请退款',
        3 => '已退款',
        4 => '拒绝退款',
    ],
    //货物状态 退款的
    'user_goods_status' => [
        0 => '未收到货',
        1 => '已收到货',
    ],
    //未收货退货原因
    'no_goods_reject_reason' => [
        1 => '不喜欢/不要了',
        2 => '空包裹',
        3 => '快递物流一直未送到',
        4 => '快递物流无跟踪记录',
        5 => '货物破损已拒签',
    ],
    //已收货退货原因
    'has_goods_reject_reason' => [
        11 => '我不想要了',
        12 => '商品与实际购买不符',
        13 => '收到商品有损坏',
        14 => '漏发少件',
        15 => '质量问题',
    ],
    //退款状态
    'order_reject_status' => [
        0 => '申请退款',
        1 => '同意退款',
        2 => '拒绝退款',
    ],

    //订单发货类型
    'shipping_send_type' => [
        0 => '自填快递',
        1 => '在线预约',
        2 => '电子面单',
        3 => '无需物流',
    ],

    //用户性别
    'user_sex' => [
        0  => '保密',
        1  => '男',
        2  => '女',
    ],

    'shop_goods_tongji_type' => [
        1 => '商城',
        2 => '砍价',
        3 => '拼团',
        4 => '抢购',
    ],

    //积分商城订单取消订单理由
    'integral_cancel_order_reason' => [
        1 => '付款一周内商家未发货',
        2 => '买多了/买错了',
        3 => '计划有变不想买了'
    ],

    'shop_withdraw_type' => [
        1 => '注册会员提现',
        2 => '推广员提现',
    ],

    'shop_withdraw_status' => [
        0 => '申请中',
        1 => '同意并打款',
        2 => '拒绝',
    ],


];

